app/views/posts/index.html.erb

      <div class="span4">Categories:
        <% post.categories.each do |cat| %>
---
SELECT `categories`.* FROM `categories` INNER JOIN `categories_posts` ON `categories`.`id` = `categories_posts`.`category_id` WHERE `categories_posts`.`post_id` = 1