app/controllers/categories_controller.rb

  def create

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`created_at`, `name`, `updated_at`) VALUES ('2013-02-28 18:30:32', 'New Category1', '2013-02-28 18:30:32')

  def destroy
    @category.destroy
---
DELETE FROM `categories` WHERE `categories`.`id` = 2