app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` WHERE (publish_date <= '2013-03-01') ORDER BY publish_date DESC
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1 AND (publish_date <= '2013-03-01') ORDER BY publish_date DESC
---
  def index
  #  @posts = Post.all
    @posts = Post.order('publish_date DESC')
    @posts = @posts.published if current_user.blank?

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
---
  def show
    @post = Post.find(params[:id])

INSERT INTO `posts` (`body`, `created_at`, `publish_date`, `title`, `updated_at`, `user_id`) VALUES ('SOmething', '2013-02-28 18:40:29', '2013-02-28', 'Cooll Post', '2013-02-28 18:40:29', 1)
---
  def create
    @post = Post.new(params[:post])
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save